src/cf/InformationRegisters/ОчередьОбновленияОбсуждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОбновленияОбсуждений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Чем больше приоритет, тем раньше нужно обработать запись</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаВМиллиСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:EnumRef.ЗаданияОчередиОбновленияОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ЗаданияОчередиОбновленияОбсуждений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЗаданияОчередиОбновленияОбсуждений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнитьОбработчикОбновления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьНедостающихУчастниковВАвтоОбсуждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьПодключениеОбсуждений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьОбновленияОбсуждений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет объект в очередь.
//
// Параметры:
//  Объект - СправочникСсылка - Ссылка на оъект.
//  Приоритет - Число, Неопределено - приоритет обработки добавляемой записи.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные параметры обработки записи.
//
Процедура Добавить(Объект, Приоритет = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаВремя = ТекущаяДата();
	ДатаВМиллиСекундах = ОбщегоНазначенияДокументооборот.ТекущаяДатаВМиллисекундах();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Дата = ДатаВремя;
	Запись.ДатаВМиллиСекундах = ДатаВМиллиСекундах;
	Запись.Приоритет = ?(Приоритет = Неопределено, 10, Приоритет);
	Если ДополнительныеПараметры = Неопределено
			Или ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Запись.ДополнительныеПараметры = ДополнительныеПараметрыВJSON(ДополнительныеПараметры);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неожиданный тип значения ""ДополнительныеПараметры""'");
	КонецЕсли;
	Запись.Записать(Истина);
	
	// Включение регламентного задания для обработки очереди.
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбновлениеОбсуждений);
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ПараметрыЗадания.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.ОбновлениеОбсуждений.ИмяМетода);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыЗадания);
	Если СписокЗаданий.Количество() = 0 Тогда
		ПараметрыЗадания.Вставить("Использование", Истина);
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	Иначе
		ПараметрыЗадания = Новый Структура("Использование", Истина);
		Для Каждого Задание Из СписокЗаданий Цикл
			РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Удаляет объект из очереди.
//
// Параметры:
//  Объект - СправочникСсылка - Ссылка на объект.
//  ДатаВМиллиСекундах - Число - дата в мс.
//
Процедура Удалить(Объект, ДатаВМиллиСекундах) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Объект);
	Набор.Отбор.ДатаВМиллиСекундах.Установить(ДатаВМиллиСекундах);
	Набор.Записать();
	
КонецПроцедуры

// Обрабатывает порцию объектов из очереди.
//
Функция ОбработатьОчередь() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОбновленияОбсуждений.Объект КАК Объект,
		|	ОчередьОбновленияОбсуждений.ДатаВМиллиСекундах КАК ДатаВМиллиСекундах,
		|	ОчередьОбновленияОбсуждений.ДополнительныеПараметры КАК ДополнительныеПараметрыJSON
		|ИЗ
		|	РегистрСведений.ОчередьОбновленияОбсуждений КАК ОчередьОбновленияОбсуждений
		|ГДЕ
		|	ОчередьОбновленияОбсуждений.КоличествоПопытокОбработки < 3
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОчередьОбновленияОбсуждений.Приоритет УБЫВ,
		|	ОчередьОбновленияОбсуждений.ДатаВМиллиСекундах";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Объект;
		ДатаВМиллиСекундах = Выборка.ДатаВМиллиСекундах;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОчередьОбновленияОбсуждений");
		ЭлементБлокировки.УстановитьЗначение("Объект", Объект);
		ЭлементБлокировки.УстановитьЗначение("ДатаВМиллиСекундах", ДатаВМиллиСекундах);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
			НачатьТранзакцию();
			Блокировка.Заблокировать();
			ДополнительныеПараметры = СтрокаJSONВДополнительныеПараметры(Выборка.ДополнительныеПараметрыJSON);
			ОбработатьЭлементОчереди(Объект, ДополнительныеПараметры);
			Удалить(Объект, ДатаВМиллиСекундах);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗафиксироватьНеудачнуюПопыткуОбработки(Объект, ДатаВМиллиСекундах, ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Выборка.Количество();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьЭлементОчереди(Ссылка, ДополнительныеПараметры)
	
	ТипСсылки = ТипЗнч(Ссылка);
	Если ТипСсылки = Тип("СправочникСсылка.Пользователи") Тогда
		
		ОбсужденияДокументооборот.ОбновитьПользователя(Ссылка, Истина);
		
	ИначеЕсли ТипСсылки = Тип("ПеречислениеСсылка.ЗаданияОчередиОбновленияОбсуждений") Тогда
		
		Если Ссылка = Перечисления.ЗаданияОчередиОбновленияОбсуждений.ДобавитьНедостающихУчастниковВАвтоОбсуждения Тогда
			ОбсужденияДокументооборот.АктуализироватьСоставАвтообсуждений(Истина);
		ИначеЕсли Ссылка = Перечисления.ЗаданияОчередиОбновленияОбсуждений.ВыполнитьОбработчикОбновления Тогда
			ПараметрыОбработчика = Новый Массив;
			ПараметрыОбработчика.Добавить(Истина); // Немедленно.
			ОбщегоНазначения.ВыполнитьМетодКонфигурации(
				ДополнительныеПараметры.ИмяОбработчика, ПараметрыОбработчика);
		ИначеЕсли Ссылка = Перечисления.ЗаданияОчередиОбновленияОбсуждений.ОбработатьПодключениеОбсуждений Тогда
			ОбсужденияДокументооборот.ПриИзмененииСостоянияПодключения(Истина);
		КонецЕсли;
		
	Иначе // Контейнер авточата.
		
		Операция = Неопределено;
		Если ДополнительныеПараметры <> Неопределено Тогда
			ДополнительныеПараметры.Свойство("Операция", Операция);
		КонецЕсли;
		Если Операция = Неопределено Тогда
			ОбсужденияДокументооборот.ОбновитьОбсужденияПоКонтейнеру(Ссылка, ДополнительныеПараметры, Истина);
		ИначеЕсли Операция = "ОбновитьЗаголовкиАвточатов" Тогда
			ОбсужденияДокументооборот.ОбновитьЗаголовкиАвточатов(
				Ссылка, ДополнительныеПараметры.СтароеПредставление, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьНеудачнуюПопыткуОбработки(Ссылка, ДатаВМиллиСекундах, ТекстОшибки)
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Ссылка;
	МенеджерЗаписи.ДатаВМиллиСекундах = ДатаВМиллиСекундах;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.КоличествоПопытокОбработки = МенеджерЗаписи.КоличествоПопытокОбработки + 1;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ДополнительныеПараметрыВJSON(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДополнительныеПараметры, НазначениеТипаXML.Явное);

	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция СтрокаJSONВДополнительныеПараметры(СтрокаJSON)
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
